Repository: Kaedeeeeeeeeee/ios-html-markdown-previewer
Catalog: HTMLMarkdownPreviewer/Paste.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

# paste.title
source: Paste to Preview
ja: 貼り付けてプレビュー
zh_hans: 粘贴预览
zh_hant: 貼上預覽

# paste.content
source: Content
ja: 内容
zh_hans: 内容
zh_hant: 內容

# paste.placeholder
source: Paste HTML, Markdown, YAML, or JSON text here.
ja: HTML、Markdown、YAML、JSON のテキストを貼り付けてください。
zh_hans: 在这里粘贴 HTML、Markdown、YAML 或 JSON 文本。
zh_hant: 在此貼上 HTML、Markdown、YAML 或 JSON 文字。

# paste.contentHint
source: Paste HTML, Markdown, YAML, or JSON content. Text stays on this device.
ja: HTML、Markdown、YAML、JSON を貼り付けます。テキストはこのデバイス内に保存されます。
zh_hans: 粘贴 HTML、Markdown、YAML 或 JSON 内容。文本仅保存在此设备上。
zh_hant: 貼上 HTML、Markdown、YAML 或 JSON 內容。文字只會儲存在此裝置上。

# paste.document
source: Document
ja: ドキュメント
zh_hans: 文档
zh_hant: 文件

# paste.format
source: Format
ja: 形式
zh_hans: 格式
zh_hant: 格式

# paste.name
source: Name (optional)
ja: 名前（任意）
zh_hans: 名称（可选）
zh_hant: 名稱（選填）

# paste.defaultName
source: Pasted Document
ja: 貼り付けたドキュメント
zh_hans: 粘贴的文档
zh_hant: 貼上的文件

# paste.documentHint
source: HTML, JSON objects and arrays, and fenced formats are detected automatically. Choose YAML for plain configuration text.
ja: HTML、JSON のオブジェクトと配列、コードブロックの形式を自動判別します。通常の設定テキストには YAML を選んでください。
zh_hans: 自动识别 HTML、JSON 对象与数组及代码块格式。普通配置文本请选择 YAML。
zh_hant: 自動辨識 HTML、JSON 物件與陣列及程式碼區塊格式。一般設定文字請選擇 YAML。

# paste.preview
source: Preview
ja: プレビュー
zh_hans: 预览
zh_hant: 預覽

# paste.preparing
source: Preparing Preview…
ja: プレビューを準備中…
zh_hans: 正在准备预览…
zh_hant: 正在準備預覽…

# paste.cannotPreview
source: Cannot Preview Text
ja: テキストをプレビューできません
zh_hans: 无法预览文本
zh_hant: 無法預覽文字

# paste.error.empty
source: Paste or enter some HTML, Markdown, YAML, or JSON text first.
ja: HTML、Markdown、YAML、JSON のテキストを貼り付けるか入力してください。
zh_hans: 请先粘贴或输入 HTML、Markdown、YAML 或 JSON 文本。
zh_hant: 請先貼上或輸入 HTML、Markdown、YAML 或 JSON 文字。

# paste.error.webAddress
source: Paste the document content itself. Opening web links is not supported here.
ja: 文書の内容を貼り付けてください。ここでは Web リンクを開けません。
zh_hans: 请粘贴文档内容本身，此处不支持打开网页链接。
zh_hant: 請貼上文件內容本身，此處不支援開啟網頁連結。

# paste.error.tooLarge
source: This text is larger than 2 MB. Open it as a file instead.
ja: テキストが 2 MB を超えています。ファイルに保存してから「ファイルを開く」で読み込んでください。
zh_hans: 文本超过 2 MB，请保存为文件后通过“打开文件”导入。
zh_hant: 文字超過 2 MB，請儲存為檔案後透過「開啟檔案」匯入。

# paste.importSource
source: Pasted Text
ja: 貼り付けたテキスト
zh_hans: 粘贴文本
zh_hant: 貼上的文字
